Repository: GrrravityBusiness/tictactoe
Catalog: lib/core/localization/app_*.arb
Languages: fr

# nav_go_to_onboarding
source: Change my name
fr: Changer de nom

# onboarding_step_add_name
source: Start by creating your player name
fr: Commence par créer ton nom

# onboarding_action_validate_name
source: That's my name !
fr: C'est bien moi !

# onboarding_welcome_title
source: Tic Tac Toe
fr: Bienvenue sur TicTacToe

# onboarding_field_playername_label
source: Player Name
fr: Nom de joueur

# theme_action_toggle
source: Toggle Theme
fr: Changer de thème

# onboarding_prevent_close_title
source: You have to set yourself a name before leaving!
fr: Choisis un nom avant de partir !

# lobby_welcome_message
source: Hello {playerName}, ready to play ?
fr: Bonjour {playerName}, prêt à jouer ?

# lobby_field_opponent_label
source: Name
fr: Nom

# lobby_select_opponent_title
source: Who are we fighting?
fr: Nomme ton adversaire :

# lobby_page_error_message
source: An error occurred
fr: Une erreur s'est produite

# rule_one
source: 1. The game is played on a 3x3 grid.
fr: 1. Le jeu se joue sur une grille de 3x3.

# rule_two_1
source: 2. Two players take turns: one is
fr: 2. Deux joueurs jouent à tour de rôle : l'un est

# rule_two_2
source: , the other is
fr: , l'autre est

# rule_four
source: 4. The first player to get 3 of their marks in a row (vertically, horizontally, or diagonally) wins.
fr: 4. Le premier joueur à aligner 3 de ses symboles (verticalement, horizontalement ou en diagonale) gagne.

# rule_three
source: 3. Players mark empty squares with their symbol.
fr: 3. Les joueurs marquent les cases vides avec leur symbole.

# rule_five
source: 5. If all 9 squares are filled and no player has 3 in a row, the game is a draw.
fr: 5. Si les 9 cases sont remplies et qu'aucun joueur n'a aligné 3 symboles, c'est une égalité.

# rule_title
source: TicTacToe Rules
fr: Règles du TicTacToe

# rule_cases_example
source: Examples:
fr: Exemples :

# rule_horizontal_x_win
source: X wins (horizontal)
fr: X gagne (horizontal)

# rule_diagonal_0_win
source: O wins (diagonal)
fr: O gagne (diagonale)

# rule_vertical_o_win
source: O wins (vertical)
fr: O gagne (vertical)

# rule_draw
source: Draw (no winner)
fr: Match nul (aucun gagnant)

# lobby_see_rules
source: Check game rules
fr: Voir les règles du jeu

# lobby_start_game
source: Start !
fr: Démarrer la partie !

# lobby_scoreboard_title
source: Scoreboard
fr: Scores

# game_result_dialog_label
source: Game Result
fr: Résultat

# game_result_back_lobby_action
source: Back to Lobby
fr: Accueil

# game_result_continue_play_action
source: Play Again
fr: Rejouer

# game_result_draw_text
source: It's a Draw!
fr: Match nul !

# game_result_winner_text
source: {winnerName} Wins !
fr: {winnerName} gagne !
